[
  {
    "name": "Social Venture Partners",
    "type": "Decision-making Platform",
    "terms": "Fall 2019 - Fall 2020",
    "caseStudyUrl": "",
    "githubUrl": "https://github.com/uwblueprint/arbitrium",
    "about": "Social Venture Partners (SVP) is an organization dedicated to supporting local nonprofits with funding, resources, and capacity building initiatives.",
    "solution": "Our team developed a platform that would allow SVP to better manage their nonprofit applications pipeline and streamline the funding-selection process. As apart of the project, we also redesigned the user experience and created a more flexible and scalable web application.",
    "quote": {
      "text": "Each step of the way, Blueprint’s team asked lots of questions to ensure what they were developing matched expectations, and were transparent around their processes.",
      "signature": "Taryn Graham, Operations & Communications Manager at SVPWR"
    },
    "image": "/projects/social-venture-partners.png"
  },
  {
    "name": "Paramedics",
    "type": "Web & iPad App",
    "terms": "Winter 2020 - Fall 2020",
    "caseStudyUrl": "",
    "githubUrl": "https://github.com/uwblueprint/paramedics-react",
    "about": "The Region of Waterloo Paramedic Services is an emergency medical service provider for the Regional Municipality of Waterloo.",
    "solution": "Our team built a web and iPad solution for mass-casualty incidents. The iPad component is used by paramedics in the field for patient tracking and triaging while the web component is used to view patient statuses from the command centre.",
    "quote": {
      "text": "We are extremely extremely proud of the project the team has made and super happy to have the team as a part of the project.",
      "signature": "Stephen Yang, Project Lead and Howard Yu, Project Manager"
    },
    "image": "/projects/paramedics.png"
  },
  {
    "name": "Dancefest",
    "type": "Adjudication Platform",
    "terms": "Winter 2018 - Winter 2021",
    "caseStudyUrl": "",
    "githubUrl": "https://github.com/uwblueprint/dancefest-web",
    "about": "The Ontario Secondary School Dancefest is a free recreational dance program intended to encourage students from grades 1 - 12 to participate in creative and active extracurricular activity. Each year, the organization hosts a major 3-day event - complete with inspirational speakers, technique workshops, and a flagship competition.",
    "solution": "In an effort to support the smooth operations of the annual dance convention, our team built a platform that would streamline the competition judging process. The platform was compatible with any judging device, ensured data privacy, and digitized processes including scoresheet collection, contestant and ranking in order to alleviate time and energy on part of event organizers.",
    "quote": {
      "text": "It was a very satisfying experience for our board to have Blueprint working to make our provincial event for high school students much better.",
      "signature": "Laurel Brown, President at OSSDF"
    },
    "image": "/projects/dancefest.png"
  },
  {
    "name": "Plastics for Change",
    "type": "Web Platform",
    "terms": "Summer 2018 - Winter 2019",
    "caseStudyUrl": "",
    "githubUrl": "https://github.com/uwblueprint/plasta",
    "about": "Plastics for Change (PFC) is dedicated to creating resilient neighbourhoods for the urban poor in developing countries. PFC uses mobile technology to reduce plastic pollution by convincing brands to adopt more ethical supply chain practices that use recycled plastics.",
    "solution": "Our team focused on providing a single source of truth for all data and transactions between stakeholders within the recycled plastic ecosystem. Through interaction design, development, and data engineering, we built a product that helps PFC monitor vital metrics about pricing, quality, and wages.",
    "quote": {
      "text": "Working on the project was a very rewarding experience in every facet for me. From being able to have real world impact to learning about new technologies, I had an amazing time. On top of this, I’ve made some lifelong friends who worked on the project with me, and for that I am very grateful.",
      "signature": "Ahmed Hamodi, Project Developer"
    },
    "image": "/projects/plastics-for-change.png"
  }
]
