[
  {
    "name": "Project READ Literacy Network",
    "type": "Website Redesign",
    "githubUrl": "https://github.com/uwblueprint/project-read-frontend",
    "description": [
      "is an organization that empowers families in the Waterloo region with access to literacy and essential skills training.",
      "Our team built a system to streamline outreach and operations for Project READ by tracking interactions with families. The product ultimately allowed staff to more efficiently make strategic decisions that would drive organizational growth."
    ],
    "image": "/projects/project-read.svg"
  },
  {
    "name": "The Shoe Project",
    "type": "Website Redesign",
    "githubUrl": "https://github.com/uwblueprint/shoe-project",
    "description": [
      "provides educational and leadership opportunities to immigrant and refugee women. They have created a platform for women to showcase their moving stories using a shoe as a metaphor.",
      "To celebrate their 10th anniversary, our team developed an interactive visualization tool leveraging geo-mapping technology to capture the stories of women across the world, collected throughout the organization's 10-year history."
    ],
    "image": "/projects/the-shoe-project.svg"
  },
  {
    "name": "The Pregnancy Centre",
    "type": "Website Redesign",
    "githubUrl": "https://github.com/uwblueprint/pregnancy-centre",
    "linkText": "The Pregnancy Centre (TPC)",
    "description": [
      "supports mothers and families in Waterloo Region in making healthy and informed relationship and pregnancy decisions.",
      "Our team built a web portal that would enable TPC to facilitate the collection and distribution of high quality, essential items between local donors and those in need."
    ],
    "image": "/projects/the-pregnancy-centre.svg"
  },
  {
    "name": "Building Up",
    "type": "Website Redesign",
    "githubUrl": "https://github.com/uwblueprint/building-up-client",
    "description": [
      "is a non-profit construction contractor that provides long term career pathways for individuals facing barriers to employment. One of their main fundraising efforts in partnership with Raising the Roof is the Toque Campaign.",
      "Our team built an online platform to streamline toque ordering and better engage third party sellers."
    ],
    "image": "/projects/building-up.svg"
  }
]
